rtn.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Header>
        <h:RequestHeader xmlns="http://dom.gosuslugi.ru/schema/integration/8.5.0.4/"
                         xmlns:h="http://dom.gosuslugi.ru/schema/integration/8.5.0.4/"
                         xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <!-- Заголовок, содержащий информацию о поставщике данных и сообщении-->
            <Date>2016-01-29T09:29:29.5033083+03:00</Date>
            <MessageGUID>${=java.util.UUID.randomUUID()}</MessageGUID>
            <orgPPAGUID>a013da6b-fd11-4b20-8903-dbbcb22ff221</orgPPAGUID>
        </h:RequestHeader>
    </s:Header>
    <s:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <exportNsiListRequest xmlns="http://dom.gosuslugi.ru/schema/integration/8.5.0.4/nsi/" Id="foo">
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="xmldsig-3f222eb1-bfe9-4da6-a121-450a984fc85c">
            <!-- Элемент, содержащий электронную подпись поставщика данных -->
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                    <ds:SignatureMethod Algorithm="urn:ietf:params:xml:ns:cpxmlsec:algorithms:gostr34102012-gostr34112012-256"/>
                    <ds:Reference URI="#foo">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="urn:ietf:params:xml:ns:cpxmlsec:algorithms:gostr34112012-256"/>
                        <ds:DigestValue>RML7HeI83whzrRjK3S02X4MlVGrSIIWHVC3x3la+IZc=</ds:DigestValue>
                    </ds:Reference>
                    <ds:Reference URI="#xmldsig-3f222eb1-bfe9-4da6-a121-450a984fc85c-signedprops" Type="http://uri.etsi.org/01903#SignedProperties">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="urn:ietf:params:xml:ns:cpxmlsec:algorithms:gostr34112012-256"/>
                        <ds:DigestValue>oYIU+RWjn9wSku3ixrJy48TMqRU4geh9HE4LLL7lmhk=</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue>alQ98eCzqfxzOM66D9oqXqibLpT7n9epRju90+98TVDCh1Pyu365QcBWbd8mYMpzvb5nhYdhK5YMsgZQ8y/2EA==</ds:SignatureValue>
                <ds:KeyInfo Id="xmldsig-61b74cb4-68b2-439c-9533-8668dc82d1dd">
                    <ds:X509Data xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                        <ds:X509Certificate>MIIEOzCCA+igAwIBAgITfAAAIl69xb6XX81K7wABAAAiXjAKBggqhQMHAQEDAjCCAQoxGDAWBgUq
hQNkARINMTIzNDU2Nzg5MDEyMzEaMBgGCCqFAwOBAwEBEgwwMDEyMzQ1Njc4OTAxLzAtBgNVBAkM
JtGD0LsuINCh0YPRidGR0LLRgdC60LjQuSDQstCw0Lsg0LQuIDE4MQswCQYDVQQGEwJSVTEZMBcG
A1UECAwQ0LMuINCc0L7RgdC60LLQsDEVMBMGA1UEBwwM0JzQvtGB0LrQstCwMSUwIwYDVQQKDBzQ
ntCe0J4gItCa0KDQmNCf0KLQni3Qn9Cg0J4iMTswOQYDVQQDDDLQotC10YHRgtC+0LLRi9C5INCj
0KYg0J7QntCeICLQmtCg0JjQn9Ci0J4t0J/QoNCeIjAeFw0xOTAzMjYxNTQ2MDlaFw0yMDAzMjYx
NTU2MDlaMBExDzANBgNVBAMMBnF3ZXF3ZTBmMB8GCCqFAwcBAQEBMBMGByqFAwICJAAGCCqFAwcB
AQICA0MABEAITPXfzlPyUvEdyIu9xdiJ3/pyWoyPpJGSnpB2tcOmDSKgY820V6aGKoCRbD+7ERfy
Fmj7mDagaPpCmE4gh77go4ICFTCCAhEwDgYDVR0PAQH/BAQDAgTwMBMGA1UdJQQMMAoGCCsGAQUF
BwMCMB0GA1UdDgQWBBTmibcoo8HRfZ6tV6Gqye6Y7slQVjAfBgNVHSMEGDAWgBSbhV77gdxNWQdR
Y8++39osf8lEPDCBzAYDVR0fBIHEMIHBMIG+oIG7oIG4hoG1aHR0cDovL3Rlc3Rnb3N0MjAxMi5j
cnlwdG9wcm8ucnUvQ2VydEVucm9sbC8hMDQyMiEwNDM1ITA0NDEhMDQ0MiEwNDNlITA0MzIhMDQ0
YiEwNDM5JTIwITA0MjMhMDQyNiUyMCEwNDFlITA0MWUhMDQxZSUyMCEwMDIyITA0MWEhMDQyMCEw
NDE4ITA0MWYhMDQyMiEwNDFlLSEwNDFmITA0MjAhMDQxZSEwMDIyKDEpLmNybDCB2gYIKwYBBQUH
AQEEgc0wgcowRAYIKwYBBQUHMAKGOGh0dHA6Ly90ZXN0Z29zdDIwMTIuY3J5cHRvcHJvLnJ1L0Nl
cnRFbnJvbGwvcm9vdDIwMTguY3J0MD8GCCsGAQUFBzABhjNodHRwOi8vdGVzdGdvc3QyMDEyLmNy
eXB0b3Byby5ydS9vY3NwMjAxMmcvb2NzcC5zcmYwQQYIKwYBBQUHMAGGNWh0dHA6Ly90ZXN0Z29z
dDIwMTIuY3J5cHRvcHJvLnJ1L29jc3AyMDEyZ3N0L29jc3Auc3JmMAoGCCqFAwcBAQMCA0EAshoi
XbdKE+B6G5+gvvb7XamJAjsQPfDbzKAbotvhfYn7e9fmBKs6JugN8/4RR+P20wblrW3lcSsFPATG
rX+ZKw==</ds:X509Certificate>
                    </ds:X509Data>
                </ds:KeyInfo>
                <ds:Object>
                    <xades:QualifyingProperties xmlns:xades="http://uri.etsi.org/01903/v1.3.2#" Target="#xmldsig-3f222eb1-bfe9-4da6-a121-450a984fc85c">
                        <xades:SignedProperties Id="xmldsig-3f222eb1-bfe9-4da6-a121-450a984fc85c-signedprops">
                            <xades:SignedSignatureProperties>
                                <xades:SigningTime>2019-04-18T12:39:59.239+03:00</xades:SigningTime>
                                <xades:SigningCertificate>
                                    <xades:Cert>
                                        <xades:CertDigest>
                                            <ds:DigestMethod Algorithm="urn:ietf:params:xml:ns:cpxmlsec:algorithms:gostr34112012-256"/>
                                            <ds:DigestValue>HNGQRbX8zzFa9F9Qg7jOO8urNG93+9AYuyEG9dVfgUA=</ds:DigestValue>
                                        </xades:CertDigest>
                                        <xades:IssuerSerial>
                                            <ds:X509IssuerName>cn=Тестовый УЦ ООО \"КРИПТО-ПРО\",o=ООО \"КРИПТО-ПРО\",l=Москва,st=г. Москва,c=RU,street=ул. Сущёвский вал д.18,1.2.643.3.131.1.1=001234567890,1.2.643.100.1=1234567890123</ds:X509IssuerName>
                                            <ds:X509SerialNumber>2765292450303474073288100094019649762249155166</ds:X509SerialNumber>
                                        </xades:IssuerSerial>
                                    </xades:Cert>
                                </xades:SigningCertificate>
                            </xades:SignedSignatureProperties>
                        </xades:SignedProperties>
                    </xades:QualifyingProperties>
                </ds:Object>
            </ds:Signature>
        <!--Элемент, описывающий бизнес-данные-->
        </exportNsiListRequest>
    </s:Body>
</s:Envelope>
